tap "hashicorp/tap"

brew "ffmpeg"
brew "gh"

brew "git"
brew "jq"
brew "llvm"
brew "neofetch"
brew "neovim"
brew "pyenv"
brew "rbenv"
brew "ripgrep"
brew "hashicorp/tap/terraform"
brew "tmux"
brew "tree"
brew "zoxide"
brew "zsh-autosuggestions"

brew "bat"
brew "fzf"
brew "postgresql"

cask "ghostty"
cask "hashicorp-vagrant"
cask "mitmproxy"
cask "vlc"
cask "zed"

# orgmode deps
tap "d12frosted/emacs-plus"

brew "d12frosted/emacs-plus/emacs-plus"
brew "fd"
brew "markdown"
brew "shellcheck"

cask "syncthing"
